*** src/adapters/user_display/memory_display.rs:22:9: replace InMemoryDisplay::get_success_messages -> Vec<String> with vec![]

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::get_success_messages -> Vec<String> with vec![]
@@ -14,17 +14,17 @@
     pub fn new() -> Self {
         Self {
             success_messages: Arc::new(RwLock::new(Vec::new())),
             info_messages: Arc::new(RwLock::new(Vec::new())),
         }
     }
 
     pub fn get_success_messages(&self) -> Vec<String> {
-        self.success_messages.read().unwrap().clone()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_info_messages(&self) -> Vec<String> {
         self.info_messages.read().unwrap().clone()
     }
 
     pub fn get_all_messages(&self) -> Vec<String> {
         let mut all = Vec::new();

---- adapters::user_display::memory_display::tests::test_multiple_messages stdout ----

thread 'adapters::user_display::memory_display::tests::test_multiple_messages' (69172017) panicked at src/adapters/user_display/memory_display.rs:127:9:
assertion `left == right` failed
  left: 0
 right: 2

---- adapters::user_display::memory_display::tests::test_success_message stdout ----

thread 'adapters::user_display::memory_display::tests::test_success_message' (69172018) panicked at src/adapters/user_display/memory_display.rs:106:9:
assertion `left == right` failed
  left: 0
 right: 1

---- adapters::user_display::memory_display::tests::test_thread_safety stdout ----

thread 'adapters::user_display::memory_display::tests::test_thread_safety' (69172019) panicked at src/adapters/user_display/memory_display.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 10

failures:
    adapters::user_display::memory_display::tests::test_multiple_messages
    adapters::user_display::memory_display::tests::test_success_message
    adapters::user_display::memory_display::tests::test_thread_safety

test result: FAILED. 297 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
