*** src/adapters/user_display/memory_display.rs:22:9: replace InMemoryDisplay::get_success_messages -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::get_success_messages -> Vec<String> with vec!["xyzzy".into()]
@@ -14,17 +14,17 @@
     pub fn new() -> Self {
         Self {
             success_messages: Arc::new(RwLock::new(Vec::new())),
             info_messages: Arc::new(RwLock::new(Vec::new())),
         }
     }
 
     pub fn get_success_messages(&self) -> Vec<String> {
-        self.success_messages.read().unwrap().clone()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_info_messages(&self) -> Vec<String> {
         self.info_messages.read().unwrap().clone()
     }
 
     pub fn get_all_messages(&self) -> Vec<String> {
         let mut all = Vec::new();

---- adapters::user_display::memory_display::tests::test_clear stdout ----

thread 'adapters::user_display::memory_display::tests::test_clear' (69175372) panicked at src/adapters/user_display/memory_display.rs:140:9:
assertion `left == right` failed
  left: 1
 right: 0

---- adapters::user_display::memory_display::tests::test_multiple_messages stdout ----

thread 'adapters::user_display::memory_display::tests::test_multiple_messages' (69175378) panicked at src/adapters/user_display/memory_display.rs:127:9:
assertion `left == right` failed
  left: 1
 right: 2

---- adapters::user_display::memory_display::tests::test_success_message stdout ----

thread 'adapters::user_display::memory_display::tests::test_success_message' (69175379) panicked at src/adapters/user_display/memory_display.rs:107:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "Operation successful"

failures:
    adapters::user_display::memory_display::tests::test_clear
    adapters::user_display::memory_display::tests::test_multiple_messages
    adapters::user_display::memory_display::tests::test_success_message
    adapters::user_display::memory_display::tests::test_thread_safety

test result: FAILED. 296 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.70s

*** result: Failure(101)
