*** src/adapters/user_display/memory_display.rs:26:9: replace InMemoryDisplay::get_info_messages -> Vec<String> with vec![]

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::get_info_messages -> Vec<String> with vec![]
@@ -18,17 +18,17 @@
         }
     }
 
     pub fn get_success_messages(&self) -> Vec<String> {
         self.success_messages.read().unwrap().clone()
     }
 
     pub fn get_info_messages(&self) -> Vec<String> {
-        self.info_messages.read().unwrap().clone()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_all_messages(&self) -> Vec<String> {
         let mut all = Vec::new();
         all.extend(self.success_messages.read().unwrap().clone());
         all.extend(self.info_messages.read().unwrap().clone());
         all
     }

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator' (69176996) panicked at src/adapters/user_display/memory_display.rs:191:9:
assertion `left == right` failed
  left: 0
 right: 1

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator' (69176997) panicked at src/adapters/user_display/memory_display.rs:207:9:
assertion `left == right` failed
  left: 0
 right: 1

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator' (69176998) panicked at src/adapters/user_display/memory_display.rs:175:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_with_prefix
    adapters::user_display::memory_display::tests::test_info_message
    adapters::user_display::memory_display::tests::test_multiple_messages
    adapters::user_display::memory_display::tests::test_thread_safety

test result: FAILED. 293 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
