*** src/adapters/user_display/memory_display.rs:26:9: replace InMemoryDisplay::get_info_messages -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::get_info_messages -> Vec<String> with vec!["xyzzy".into()]
@@ -18,17 +18,17 @@
         }
     }
 
     pub fn get_success_messages(&self) -> Vec<String> {
         self.success_messages.read().unwrap().clone()
     }
 
     pub fn get_info_messages(&self) -> Vec<String> {
-        self.info_messages.read().unwrap().clone()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_all_messages(&self) -> Vec<String> {
         let mut all = Vec::new();
         all.extend(self.success_messages.read().unwrap().clone());
         all.extend(self.info_messages.read().unwrap().clone());
         all
     }

---- adapters::user_display::memory_display::tests::test_clear stdout ----

thread 'adapters::user_display::memory_display::tests::test_clear' (69180438) panicked at src/adapters/user_display/memory_display.rs:141:9:
assertion `left == right` failed
  left: 1
 right: 0

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator' (69180439) panicked at src/adapters/user_display/memory_display.rs:192:9:
Expected done state to use filled circle (●), got: xyzzy

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator' (69180440) panicked at src/adapters/user_display/memory_display.rs:208:9:
Expected todo state to use empty circle (○), got: xyzzy

failures:
    adapters::user_display::memory_display::tests::test_clear
    adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_todo_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_with_prefix
    adapters::user_display::memory_display::tests::test_info_message
    adapters::user_display::memory_display::tests::test_thread_safety

test result: FAILED. 293 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.80s

*** result: Failure(101)
