*** src/adapters/user_display/memory_display.rs:30:9: replace InMemoryDisplay::get_all_messages -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::get_all_messages -> Vec<String> with vec![String::new()]
@@ -22,20 +22,17 @@
         self.success_messages.read().unwrap().clone()
     }
 
     pub fn get_info_messages(&self) -> Vec<String> {
         self.info_messages.read().unwrap().clone()
     }
 
     pub fn get_all_messages(&self) -> Vec<String> {
-        let mut all = Vec::new();
-        all.extend(self.success_messages.read().unwrap().clone());
-        all.extend(self.info_messages.read().unwrap().clone());
-        all
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn clear(&self) {
         self.success_messages.write().unwrap().clear();
         self.info_messages.write().unwrap().clear();
     }
 }

---- adapters::user_display::memory_display::tests::test_multiple_messages stdout ----

thread 'adapters::user_display::memory_display::tests::test_multiple_messages' (69183819) panicked at src/adapters/user_display/memory_display.rs:126:9:
assertion `left == right` failed
  left: 1
 right: 3

---- application::show_log::tests::test_show_log_displays_events stdout ----

thread 'application::show_log::tests::test_show_log_displays_events' (69183948) panicked at src/application/show_log.rs:83:9:
Expected log to contain author email 'test@test.com', got: [""]

failures:
    adapters::user_display::memory_display::tests::test_multiple_messages
    application::show_log::tests::test_show_log_displays_events

test result: FAILED. 298 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.66s

*** result: Failure(101)
