*** src/adapters/user_display/memory_display.rs:37:9: replace InMemoryDisplay::clear with ()

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ replace InMemoryDisplay::clear with ()
@@ -29,18 +29,17 @@
     pub fn get_all_messages(&self) -> Vec<String> {
         let mut all = Vec::new();
         all.extend(self.success_messages.read().unwrap().clone());
         all.extend(self.info_messages.read().unwrap().clone());
         all
     }
 
     pub fn clear(&self) {
-        self.success_messages.write().unwrap().clear();
-        self.info_messages.write().unwrap().clear();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for InMemoryDisplay {
     fn default() -> Self {
         Self::new()
     }
 }

---- adapters::user_display::memory_display::tests::test_clear stdout ----

thread 'adapters::user_display::memory_display::tests::test_clear' (69187195) panicked at src/adapters/user_display/memory_display.rs:139:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    adapters::user_display::memory_display::tests::test_clear

test result: FAILED. 299 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.74s

*** result: Failure(101)
