*** src/adapters/user_display/memory_display.rs:65:13: delete match arm "wip" in <impl DisplayPort for InMemoryDisplay>::display_yak_pretty

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ delete match arm "wip" in <impl DisplayPort for InMemoryDisplay>::display_yak_pretty
@@ -57,17 +57,17 @@
         self.info_messages
             .write()
             .unwrap()
             .push(message.to_string());
     }
 
     fn display_yak_pretty(&self, prefix: &str, name: &Name, state: &str) {
         let indicator = match state {
-            "wip" => "●",
+             /* ~ changed by cargo-mutants ~ */
             "done" => "●",
             _ => "○",
         };
         self.info_messages
             .write()
             .unwrap()
             .push(format!("{prefix}{indicator} {name}"));
     }

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator' (69188990) panicked at src/adapters/user_display/memory_display.rs:176:9:
Expected wip state to use filled circle (●), got: ○ test-yak

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_with_prefix stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_with_prefix' (69188991) panicked at src/adapters/user_display/memory_display.rs:224:9:
Expected output to start with '  ●', got:   ○ test-yak

failures:
    adapters::user_display::memory_display::tests::test_display_yak_pretty_wip_indicator
    adapters::user_display::memory_display::tests::test_display_yak_pretty_with_prefix

test result: FAILED. 298 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
