*** src/adapters/user_display/memory_display.rs:66:13: delete match arm "done" in <impl DisplayPort for InMemoryDisplay>::display_yak_pretty

*** mutation diff:
--- src/adapters/user_display/memory_display.rs
+++ delete match arm "done" in <impl DisplayPort for InMemoryDisplay>::display_yak_pretty
@@ -58,17 +58,17 @@
             .write()
             .unwrap()
             .push(message.to_string());
     }
 
     fn display_yak_pretty(&self, prefix: &str, name: &Name, state: &str) {
         let indicator = match state {
             "wip" => "●",
-            "done" => "●",
+             /* ~ changed by cargo-mutants ~ */
             _ => "○",
         };
         self.info_messages
             .write()
             .unwrap()
             .push(format!("{prefix}{indicator} {name}"));
     }

---- adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator stdout ----

thread 'adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator' (69190718) panicked at src/adapters/user_display/memory_display.rs:192:9:
Expected done state to use filled circle (●), got: ○ test-yak

failures:
    adapters::user_display::memory_display::tests::test_display_yak_pretty_done_indicator

test result: FAILED. 299 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.72s

*** result: Failure(101)
